package main

import "math/rand"

// Predefined routes for drivers (St. Petersburg, Russia)
var PredefinedRoutes = [][][]float64{
	{
		{59.9342802, 30.3350986}, // Невский проспект
		{59.936365, 30.321251},   // Казанский собор
		{59.934598, 30.306005},   // Исаакиевский собор
		{59.931099, 30.314556},   // Адмиралтейство
	},
	{
		{59.944543, 30.278802},   // Васильевский остров, стрелка
		{59.950037, 30.316229},   // Петропавловская крепость
		{59.956059, 30.317533},   // Кунсткамера
		{59.948377, 30.360096},   // Летний сад
	},
	{
		{59.929354, 30.345894},   // Московский вокзал
		{59.927389, 30.360819},   // Лиговский проспект
		{59.922592, 30.354943},   // Владимирская площадь
		{59.918876, 30.347428},   // Сенная площадь
	},
	{
		{59.939095, 30.315868},   // Дворцовая площадь
		{59.938676, 30.323045},   // Эрмитаж
		{59.934598, 30.306005},   // Исаакиевский собор
		{59.931830, 30.303700},   // Медный всадник
	},
}


func GenerateRandomPlate() string {
	letters := "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
	plate := ""
	for i := 0; i < 3; i++ {
		plate += string(letters[rand.Intn(len(letters))])
	}

	return plate
}